import re
import requests

'''
var hq_str_sh601688=
"华泰证券,20.280,20.250,20.340,20.400,20.200,20.320,20.340,5737081,
116441306.000,1200,20.320,4900,20.310,44300,20.300,30200,20.290,18900,20.280,2300,20.340,
24200,20.350,31900,20.360,50800,20.370,27800,20.380,2016-11-22,09:48:11,00";

0: "华泰证券": 股票名字
1: "20.280": 今日开盘价
2: "20.250": 昨日收盘价
3: "20.340": 当前价格
4: "20.400": 今日最高价
5: "20.200": 今日最低价
6: "20.320": 竞买价，即“买一”报价
7: "20.340": 竞卖价，即“卖一”报价
8: "5737081": 成交的股票数（单位为“个”）
9: "116441306.000": 成交金额（单位为“元”）
10: "1200": “买一”申请 1200 股
11: "20.320": “买一”报价
12: "4900": “买二”申请 4900 股
13: "20.310": “买二”报价（以下依次类推）
14: "44300": 买三
15: "20.300": 买三
16: "30200": 买四
17: "20.290": 买四
18: "18900": 买五
19: "20.280": 买五
(20,21), (22,23), (24,25), (26,27), (28,29): 卖一，……，卖五
30: "2016-11-22": 日期
31: "09:48:11": 时间

'''

# 获取实时价格
def get_realtime_price(str_ticker):
    # 发送请求
    price_all = requests.get('http://hq.sinajs.cn/list=' + str_ticker).text
    print(price_all)
    price_ticker = re.findall(r'var hq_str_(.*?);', price_all)
    price_tick = price_ticker[0].split(',')  # 实时股价的list
    return price_tick


if __name__ == "__main__":
    xx = 'sz002463'
    yy = get_realtime_price(xx)
    print(yy)
